{"Alex's-Journal/Abilities/Abilities":{"title":"Abilities","links":["Alex's-Journal/The-Journal","Alex's-Journal/Abilities/Pre-Cognition","Alex's-Journal/Abilities/Telepathy","Alex's-Journal/Abilities/Time-Travel","Alex's-Journal/People/Keith","Alex's-Journal/Abilities/Weather-Control","Alex's-Journal/Abilities/Mind-reading","The-Wall/Someone","The-Wall/The-Wall","The-Wall/Xander's-Ability-List"],"tags":[],"content":"The Journal\nAbilities are… well, superpowers. Except I only call them abilities because they’re almost never as strong as comic superpowers.\nThe abilities range from mild healing, to Pre-Cognition, to Telepathy, to downright Time Travel. I’ve even met someone who could control the wind, and weather! Well, sort of met him… More on that in Keith.\nAbilities others have had:\n\nWeather Control | Keith\nMind reading | Someone\nTime Travel | Someone\nPre-Cognition | Someone\n\n\nMy abilities are on The Wall currently. Xander’s Ability List"},"Alex's-Journal/Abilities/Barriers":{"title":"Barriers","links":["Alex's-Journal/The-Journal","tags/Journal","tags/Active-Ability","Alex's-Journal/Focus","Alex's-Journal/Spirits","The-Wall/Nikko"],"tags":["Journal","Active-Ability"],"content":"The Journal\n#AbilitiesJournalActive-Ability\nBarriers are placed using focus, but stay up without it until broken by a powerful spirit or demon.\nBarriers keep an area free from spirits, and can be used to push spirits out of a place, area, or away from an object.\nA barrier can be placed on an area using reference points. This is typically done by physically touching the points you wish to connect, however, I can place them without touching the points. This means that I can place barriers on people without having to give them an awkward hug (lol).\nI’ve had an idea to place a barrier on an object and then throw it at the spirits, but I’ve been told that wouldn’t work. Mainly because they just move out of the way.\nBecause barriers take energy to place, overdoing it can lead to extreme exhaustion. Hence why barrier-ing the world isn’t possible. Or, at least, not reasonably possible.\nMy barriers are more powerful than a regular barrier, which has proven useful at times when fighting Nikko to buy me some time."},"Alex's-Journal/Abilities/Blocking-Mind-Reading":{"title":"Blocking Mind Reading","links":["Alex's-Journal/Abilities/Abilities","The-Wall/Xander's-Ability-List","tags/Active-Ability","tags/Passive-Ability"],"tags":["Active-Ability","Passive-Ability"],"content":"Abilities Xander’s Ability List\n#AbilitiesActive-AbilityPassive-Ability\nIt’s an ability I posess… I can block some people out of my head, sometimes, and for certain things… Sometimes I could trigger it, but for the most part, I wasn’t thinking of doing it."},"Alex's-Journal/Abilities/Brain-Character":{"title":"Brain Character","links":["The-Wall/The-Wall","tags/Resources","tags/wall","tags/Abilities","tags/Active-Ability","The-Wall/Someone","The-Wall/Nikko"],"tags":["Resources","wall","Abilities","Active-Ability"],"content":"The Wall\n#pageResourceswallAbilitiesActive-Ability\nA brain character is… kind of a clone? But not quite… it’s more of a mental projection of myself to the target?\nIt’s only happened once, and I probably couldn’t do it again if I tried…\nI was trying to help Someone deal with Nikko, but i wasn’t physically there…\nApparently, I appeared to them, and the strange part is, brain character me started texting me… from their phone… Meaning it could physically interact with the world? I don’t know how it worked, or what I did to do it… And it hasn’t happened since…"},"Alex's-Journal/Abilities/Bubble":{"title":"Bubble","links":["Alex's-Journal/Abilities/Abilities","The-Wall/Xander's-Ability-List","tags/Active-Ability","Alex's-Journal/Focus"],"tags":["Active-Ability"],"content":"Abilities Xander’s Ability List\n#AbilitiesActive-Ability\nA Bubble is an area of privacy… Think, a mute button…\nAnyone outside cannot hear the people inside the bubble, but the people inside can hear the people outside the bubble.\nIt’s useful for discussing in public, and keeping secrets around people that shouldn’t know them.\nA bubble can be “popped” by a couple of things… I’m not sure exactly, but I have some guesses…\n\nTalking directly to someone outside of the bubble\nLosing focus on holding up the bubble (A lot of abilities use focus)\nAnother person tries to break the bubble\nLikely more, but I’m really not sure\n"},"Alex's-Journal/Abilities/Dream-jumping":{"title":"Dream jumping","links":["Alex's-Journal/Abilities/Abilities","The-Wall/Xander's-Ability-List","tags/Active-Ability","Alex's-Journal/Abilities/Reality-Jumping"],"tags":["Active-Ability"],"content":"Abilities Xander’s Ability List\n#AbilitiesActive-Ability\nThe ability to enter the dreams of others is one I posess… though most times I have no recollection, occasionally I have very little recollection.\nOccasionally, I can dream jump into an alternate reality. Let’s call it Reality Jumping"},"Alex's-Journal/Abilities/Erasing-Memories":{"title":"Erasing Memories","links":["Alex's-Journal/Abilities/Abilities","The-Wall/Xander's-Ability-List","tags/Active-Ability","Alex's-Journal/Focus"],"tags":["Active-Ability"],"content":"Abilities Xander’s Ability List\n#AbilitiesActive-Ability\nErasing memories is a useful ability for when you really don’t wanna be found out.\nThe user, most times, can focus in order to remove memories from a person’s head. For some, though, it’s not something they can reliably do, so they have to not rely on it.\nI could do this for a bit, but it may have been a circumstance thing, as I’m not able to anymore (that I know)."},"Alex's-Journal/Abilities/Invisibility":{"title":"Invisibility","links":["Alex's-Journal/Abilities/Abilities","The-Wall/Xander's-Ability-List","tags/Active-Ability","The-Wall/Nikko","The-Wall/Someone"],"tags":["Active-Ability"],"content":"Abilities Xander’s Ability List\n#AbilitiesActive-Ability\nInvisibility, or clouding of oneself from another’s vision, is an ability in which the user is able to keep themselves and sometimes others (close) from being seen by another person.\nBack during my battle with Nikko, he was able to cloud me from Someone’s vision. They couldn’t see me until I sat down next to them and accidentally brushed up against them, so it may seem that interacting with someone breaks invisibility/clouding."},"Alex's-Journal/Abilities/Marking-People":{"title":"Marking People","links":[],"tags":[],"content":""},"Alex's-Journal/Abilities/Mental-Messages":{"title":"Mental Messages","links":["Alex's-Journal/Abilities/Abilities","The-Wall/Xander's-Ability-List","tags/Active-Ability"],"tags":["Active-Ability"],"content":"Abilities Xander’s Ability List\n#AbilitiesActive-Ability\nMental messages are like they sound.\nThe user can focus, and send thoughts to others. Some can tell where these thoughts come from, others can’t. Just that they’re the main thought in their head."},"Alex's-Journal/Abilities/Mind-reading":{"title":"Mind reading","links":["Alex's-Journal/Abilities/Abilities","tags/Active-Ability","tags/Passive-Ability","The-Wall/Someone","Alex's-Journal/Abilities/Blocking-Mind-Reading"],"tags":["Active-Ability","Passive-Ability"],"content":"Abilities\n#AbilitiesActive-AbilityPassive-Ability\nMind reading is not the same as it is in the comics, or movies. At least, not for Someone, who was the only person I knew who had it.\nThey said that you’d catch glimpses into other people’s minds.\nLike someone would think “I want a cheeseburger” and you might hear that. Of course, they could also, sometimes, focus on reading a mind, and get in. But I was able to block it somehow"},"Alex's-Journal/Abilities/Pre-Cognition":{"title":"Pre-Cognition","links":["Alex's-Journal/Abilities/Abilities","tags/Passive-Ability"],"tags":["Passive-Ability"],"content":"Abilities\n#AbilitiesPassive-Ability\nPre-cognition, or Future Prediction, is the ability to predict the future, usually in visions or premonition dreams.\nPremonition dreams are dreams of events that have not happened yet, but will in the future.\nVisions are like daydreams, happening while the user is awake, rather than asleep. These usually (to my knowledge) last less than a second for everyone else, but can last a few for the user."},"Alex's-Journal/Abilities/Reality-Jumping":{"title":"Reality Jumping","links":["Alex's-Journal/Abilities/Abilities","The-Wall/Xander's-Ability-List","tags/Passive-Ability","tags/Abilities","Alex's-Journal/People/Elizabeth"],"tags":["Passive-Ability","Abilities"],"content":"Abilities Xander’s Ability List\n#Active-AbilityPassive-AbilityAbilities\nReality jumping is akin to time travel, I guess. Though it’s only happened in my sleep for me.\nI’ve had dreams of other realities.\nEven one where I had a sister… Elizabeth, but I called her Beth."},"Alex's-Journal/Abilities/Sense-Danger":{"title":"Sense Danger","links":["Alex's-Journal/Abilities/Abilities","tags/Passive-Ability","tags/Journal"],"tags":["Passive-Ability","Journal"],"content":"Abilities\n#AbilitiesPassive-AbilityJournal\nSensing danger is a passive ability. If a person is about to enter a dangerous situation, or there is a dangerous entity ahead, they will get a gut feeling notifying them of that danger.\nI sensed it once when walking down the block. A car had come to a parallel park ahead of me, and stayed there. I sensed danger, and turned around. As soon as I turned, the car pulled away… That was the first gut feeling I’ve had."},"Alex's-Journal/Abilities/Telepathy":{"title":"Telepathy","links":["The-Wall/The-Wall","tags/hub","tags/Resources","tags/wall","Alex's-Journal/Abilities/Mind-reading","Alex's-Journal/Abilities/Erasing-Memories","Alex's-Journal/Abilities/Mental-Messages","Alex's-Journal/Abilities/Brain-Character"],"tags":["hub","Resources","wall"],"content":"The Wall\n#AbilitieshubResourceswall\nTelepathy is more of an umbrella category for a host of mental-related powers.\nI’ll list a couple here…\nMind reading,\nErasing Memories,\nMental Messages,\nMaybe Brain Characters, but I’m less sure about that one, and moreso just putting it here as I have nowhere else to put it…\nAs well as more when I figure them out."},"Alex's-Journal/Abilities/Time-Travel":{"title":"Time Travel","links":["Alex's-Journal/Abilities/Abilities","tags/Abilities"],"tags":["Abilities"],"content":"Abilities\n#Active-AbilityAbilities\nTime travel is, a subject.\nThis travel works a little different to movie time travel.\nIf you go back, depending on how far, you go back to the body you had at that time.\nIf you go forward, depending on how far, you go forward to the body you have at that time.\nHowever, depending on how far you go either way, you take your current body, or a copy of it at least. Your actual body stays in its current time. Depending on how far you’re gone, or how long you’re gone, your body stays “asleep” for a while.\nYou wake up as if it was all a dream.\nSupposedly, some can take others with them, but they likely won’t remember.\nThe other thing: The timeline is somewhat set in stone, so as far as I know, you can’t cause a paradox as easily as you may think…\nNot a power I have, but a power I think is cool."},"Alex's-Journal/Abilities/Weather-Control":{"title":"Weather Control","links":["Alex's-Journal/Abilities/Abilities","Alex's-Journal/People/Keith","tags/Active-Ability"],"tags":["Active-Ability"],"content":"Abilities Keith\n#AbilitiesActive-Ability\nKeith had this one. I haven’t been able to study it, as when I saw him in person, he wasn’t able to use it full strength (see here for more info). But when he used it, he was able to control the wind a little bit, enough to swirl leaves on the ground reliably."},"Alex's-Journal/Cookies":{"title":"Cookies","links":["The-Wall/Nikko","The-Wall/Someone"],"tags":[],"content":"Nikko\nYeah I bullied a demon over cookies.\nI asked him if he wanted cookies, to which he replied (over text, using Someone’s phone) “STOP” many times. I just didn’t stop asking him about them until I arrived at my destination."},"Alex's-Journal/Focus":{"title":"Focus","links":["Alex's-Journal/The-Journal","tags/Abilities-Related","tags/Journal"],"tags":["Abilities-Related","Journal"],"content":"The Journal\n#ResourcesAbilities-RelatedJournal\nA lot of abilities rely on focus to activate them, or keep them active.\nThis is important, as it means you must have intent and focus when you want to use your ability to its fullest potential.\nSome abilities are physically draining though, so you can’t keep them up forever."},"Alex's-Journal/Items/Magic-Bracelet":{"title":"Magic Bracelet","links":["Alex's-Journal/The-Journal","tags/Abilities-Related","tags/Journal","tags/Resources","The-Wall/Someone","Alex's-Journal/Abilities/Sense-Danger"],"tags":["Abilities-Related","Journal","Resources"],"content":"The Journal\n#itemsAbilities-RelatedJournalResources\nThis bracelet was gifted to me by Someone.\n\nI was told that it was extremely useful to others like us…\nIt does a few things:\n\nDetects time loops\nStrengthens Abilities\nRelays danger to the wearer? (see Sensing danger)\nLooks cool\nLikely more, but I didn’t ask questions when I could…\n"},"Alex's-Journal/Pages/First-Journal-Page":{"title":"First Journal Page","links":["Alex's-Journal/The-Journal","tags/Journal","The-Wall/Alexander","Alex's-Journal/Abilities/Abilities","The-Wall/Someone","The-Wall/Xander's-Ability-List"],"tags":["Journal"],"content":"Still in The Journal\n#pageJournal\nPage start:\nOkay, I probably should have started this long ago… I’m Xander. I’ve started this journal because I’ve experienced… Magic? I’m not sure what else to call it… But, I’m special. I have some… powers? Idk… they’re not strong… Let’s call them “Abilities”. I’ve had these for some time, and I’ve been told what they are by my ‘contact’ Someone. They told me what some of my Abilities are, and how to use some…\nI have an Xander’s Ability List, to keep track… I’m not sure if that’s all of them, but that’s the ones I know."},"Alex's-Journal/Pages/Journal-Page-09-23-2024":{"title":"Journal Page 09-23-2024","links":["Alex's-Journal/The-Journal","tags/Journal","Alex's-Journal/People/K"],"tags":["Journal"],"content":"Still in The Journal\n#pageJournal\nPage start:\nI have to attempt to tie this all together somehow… I have more information that I haven’t put in the journal because I’m not sure if I am ready to accept it…\nI have to tie it in. My contact, let’s call them K, has told me a lot about these things, but they seem so outlandish, I just don’t know where to begin.\nI have about a million questions, but I can’t find any of them to ask… And I’m not sure if I can ask any more without delving past the point of no return…\nThey’ve told me about different planes of existence, that 4d and 5d entities exist, and more, but I’m not entirely sure what I believe."},"Alex's-Journal/People/Elizabeth":{"title":"Elizabeth","links":["Alex's-Journal/Abilities/Reality-Jumping","tags/Alternate-Reality","The-Wall/Someone","Alex's-Journal/People/Someone44"],"tags":["Alternate-Reality"],"content":"Reality Jumping\n#PeopleAlternate-Reality\nElizabeth, or just Beth, as I called her, was/is my sister, but not in this universe. I dreamwalked into an alternate reality once, and she was there. Apparently I wasn’t supposed to find out about her, or something. Because Someone was told by their future self not to tell me. They did anyways though."},"Alex's-Journal/People/K":{"title":"K","links":["Alex's-Journal/The-Journal","tags/Journal"],"tags":["Journal"],"content":"The Journal\n#PeopleJournal\nK is a contact I have. They’ve told me a lot about this whole, magic, thing. But less they’ve told me about magic, and more about what’s past our perception.\nI’m keeping them anonymous as well, just as with everyone in my journal. If someone finds this, and I don’t keep people anonymous, they may be placed in a bad spot.\nAnonymity it is."},"Alex's-Journal/People/Keith":{"title":"Keith","links":["Alex's-Journal/The-Journal","The-Wall/Someone","The-Wall/Nikko","Alex's-Journal/Spirits"],"tags":[],"content":"The Journal\n#People\nFirst: Keith isn’t his real name. I don’t know his real name.\nI met Keith through Someone, during my months long fiasco with Nikko. Keith had fallen victim to Nikko, and was dead when I met him. It was within some kind of window though, that Someone was able to pull some strings, and bring him back to life. He’s out there, somewhere, with no memories of me or Someone, but still alive.\nWhen I first saw him, Someone couldn’t. I didn’t say anything to him, but he was out in a field with his friends, I presume. There were four people there, and I could see all four, but Someone could only see three of them. They couldn’t see Keith, but they could see his friends, for some reason. Like he was clouded from their vision.\n\nHe ‘died’ not long after that, and later I caught a glimpse of him walking… but only out of the corner of my eye… He talked to us, but I had to get Someone to relay what he was saying, as I couldn’t see or hear him… For some reason, they could. He was a Spirit.\nBefore this, Keith had linked himself to a magic 8 ball, and was giving us the answers he could. This is where me and Someone named him Keith, as we didn’t know his name. Apparently, while he was dead, neither did he.\nSo we call him Keith.\nI don’t know all of his abilities, but I do know that he could control the wind.\nIt was very mild last I saw him, as he wasn’t in his own body, but Someone’s… That was a very strange conversation… He doesn’t remember it though, so that’s good.  "},"Alex's-Journal/People/Someone44":{"title":"Someone44","links":["tags/People","The-Wall/Someone","The-Wall/Nikko"],"tags":["People"],"content":"People\nSomeone but from 2044.\nThey were integral in defeating Nikko. They guided us through the whole process, everything we needed. They weren’t physically here, but I first talked to them during my first experience with Nikko’s effects. He had scrambled Someone’s mind, causing them to switch between many versions of themselves. Someone44, or just 44 for short, was around for longer than any other variant, and gave me enough advice to fix the problem."},"Alex's-Journal/Someone-like-us-dies":{"title":"Someone like us dies","links":["tags/Resources","tags/Abilities-Related","Alex's-Journal/Abilities/Abilities"],"tags":["Resources","Abilities-Related"],"content":"ResourcesAbilities-Related\nWhen someone with abilities dies, one of two things can happen depending on how they die.\n\nIf they die to natural causes, or aren’t killed by another person like us, their power spreads out. Usually to whoever like us is near, but sometimes to random people.\nIf they’re killed by someone with abilities, their power goes to that person. I,E, the more people you kill, the more powerful you become.\n\nThis is what I know of the way things are. It’s unfortunate."},"Alex's-Journal/Souls":{"title":"Souls","links":["The-Wall/The-Wall"],"tags":[],"content":"The Wall\nSouls are as you might guess… Human souls, separated from their bodies at death. Some can see these souls, but most can’t…\nThey wander the world for a period of time, before either moving on to Heaven or Hell, or being stuck in Limbo forever."},"Alex's-Journal/Spirits":{"title":"Spirits","links":["The-Wall/Nikko"],"tags":[],"content":"Spirits are… Well, ghosts… Demons, etc…\nThey appear to some, and can interact with most of those that can see them. Most all spirits are bad, and only wish to hurt those around them…\nI could faintly see some at one point, but for the most part, I couldn’t… And they couldn’t interact with me.\nThe worst one I’ve interacted with is Nikko, who’s a demon. But I couldn’t directly see/hear him. More info on his page."},"Alex's-Journal/The-Journal":{"title":"The Journal","links":["Main/Main","tags/hub","tags/Resources","The-Wall/Xander's-Ability-List","Alex's-Journal/Abilities/Abilities","The-Wall/The-Wall"],"tags":["hub","Resources"],"content":"Main\n#journalhubResources\nAlex’s journal is a worn brown leather notebook with metal bunder clips to hold, add, remove, or shuffle pages. As such, some pages are not kept in the journal, but on the wall instead.\nDescription of the journal:\n\nSize: 8x10 inches\nPrimary material: Worn brown leather\nAccents: Simple brass corner covers, semi-intricate brass symbol in the center.\nSymbol:\n\n\nUse backlinks to see all pages!!\nImportant pages:\n\nXander’s Ability List\nAbilities\nThe Wall\n\n"},"Main/Main":{"title":"Main","links":["The-Wall/Alexander","The-Wall/The-Wall","Alex's-Journal/The-Journal"],"tags":[],"content":"This is the vault for a magic system in a fantasy world I’ve created.\nI don’t know many of the details, but I’m working them out.\nI’m going to write as if my character Alexander is writing it in a deconstructed journal, with some pages pinned to the wall, and threads connecting them.\nAs of 9/23/2024, it’s more magic than math (That is, there’s no math whatsoever). But there could be math in the future, so I’ve left that as an option\nPlaces to visit next:\n\nThe Wall\n\nThis is where Xander keeps some of his important notes\n\n\nThe Journal\n\nThis is where X keeps the rest of his notes\n\n\n"},"Templates/Journal-Template-(in-journal)":{"title":"Journal Template (in journal)","links":["Alex's-Journal/The-Journal","tags/Journal"],"tags":["Journal"],"content":"Still in The Journal\n#pageJournal\nPage start:"},"Templates/Journal-Template-(pinned-to-wall)":{"title":"Journal Template (pinned to wall)","links":["The-Wall/The-Wall","tags/Wall"],"tags":["Wall"],"content":"Pinned to The Wall\n#PageWall\nPage start:"},"The-Wall/Alexander":{"title":"Alexander","links":["tags/People","tags/me","Main/Main","Alex's-Journal/The-Journal"],"tags":["People","me"],"content":"Peopleme\nMain\nAlexander is in a world like ours, but with magic. He’s recently discovered that he has some ‘abilities’. He has had guides to show him a little, but for the most part, he’s trying to figure this out on his own…\nName: Alexander\nNickname(s): Xander, Alex, X\nAge: ??\nHeight: 5’11” (but he says he’s 6’0”)\nPronouns: he/him\nRelated pages: The Journal"},"The-Wall/Nikko":{"title":"Nikko","links":["The-Wall/The-Wall","Alex's-Journal/Spirits","focus","Alex's-Journal/Cookies","Alex's-Journal/Someone-like-us-dies","The-Wall/Someone"],"tags":[],"content":"The Wall\n#People\nNikko is a demon.\nLike many other demons, he manifests as a Spirit.\nWhile I couldn’t directly see or hear him, I could focus, and “guess” what he was saying. Maybe he was predictable, or maybe he was in my head. Either way, I could hold a conversation sort-of. Wasn’t any more than me bullying him about cookies, or him calling me an “Autistic bird brain” (his favorite insult).\nHis goals were to kill as many people like us as possible. (See: Someone like us dies) He worked for months trying to take Someone out, but I managed to defeat him, and save them.\nMoments before he died, he supposedly went “Biblically Accurate”, because yeah, he’s a demon. He has a few forms. One of them being a cluster of eyes and hatred.\nWhile writing this note, I remembered seeing it before… Maybe in a dream..\nNotes:\n\nHe cannot enter Holy Ground (Churches, godly houses, etc.)\nHe was defeated, and currently (If my guess is correct) is still in hell.\nI am able to summon him, as I took on that ability from Someone.\nHe was… “Created”… by Someone. They didn’t know he was bad, and it wasn’t their fault, but they still blame themselves for him.\nHe’s been around for a long time, as he can kind of travel through time.\nHe may be the cause of a lot of my insecurities, as he’s been feeding me bad thoughts for years. Since I was very little.\n"},"The-Wall/Someone":{"title":"Someone","links":["tags/People","The-Wall/Nikko","Alex's-Journal/Items/Magic-Bracelet","Alex's-Journal/People/Someone44"],"tags":["People"],"content":"People\nThe person who introduced me to all the magic… My ‘Contact’ in the world. I no longer have contact with them though.\nThey were who I went through Nikko for. They were my partner(now ex), but now, they’re just a memory for me. And I’m probably a stranger to them at this point. It’s my fault, too. But you know, we live some, we learn a lot.\nThey’re staying anonymous in here, as I don’t want to put them in any danger. Honestly, I don’t really want to think about them anymore, as it hurts to do so, but this is all tied to them.\nThey gave me the bracelet, they guided me through my abilities, they introduced me to all this.\nRelated: Someone44"},"The-Wall/The-Wall":{"title":"The Wall","links":["Main/Main","tags/hub","tags/Resources","The-Wall/Xander's-Ability-List"],"tags":["hub","Resources"],"content":"Main\n#wallhubResources\nThis will serve as the wall that some pages are pinned to.\nImportant notes:\nXander’s Ability List"},"The-Wall/Xander's-Ability-List":{"title":"Xander's Ability List","links":["Alex's-Journal/Abilities/Sense-Danger","Alex's-Journal/Abilities/Barriers","Alex's-Journal/Abilities/Blocking-Mind-Reading","Alex's-Journal/Abilities/Pre-Cognition","Alex's-Journal/Spirits","Alex's-Journal/Abilities/Dream-jumping","Alex's-Journal/Abilities/Reality-Jumping","Alex's-Journal/Abilities/Mental-Messages","Alex's-Journal/Abilities/Time-Travel","Alex's-Journal/Abilities/Erasing-Memories","Alex's-Journal/Abilities/Bubble","Alex's-Journal/Abilities/Brain-Character","Alex's-Journal/Abilities/Invisibility","Alex's-Journal/Abilities/Marking-People","The-Wall/Nikko"],"tags":[],"content":"This is a list of the abilities I have (that I know of):\nHealing\nI can Sense Danger\nAdvanced, powerful Barriers\nI can block mind reading sometimes\nPossible “convince” ability???\nPremonition Dreams, but very rare.\nI can see some Spirits, but only some?\nI can call Spirits???\nDream jumping/dreamwalking\nReality Jumping in my dreams, at times\nI can send Mental Messages (focus)\nI can feel some presence\nEnhanced smell, sight, and hearing.\nManipulate time..? Still unclear… it’s not time travel… and it’s very mild\nRemoval of Spirits/demons from people’s heads temporarily…? (Only happened once)\nMaybe electrical powers???\nI can erase memories?? (Idk how to use this one)\nBubble (only happened once)\nCreated a “Brain Character” (only happened once)\nInvisibility/clouding, but it’s only happened once to my knowledge\nMark people(only happened once)\nI took an ability to summon a spirit/demon( Nikko ) away from someone, so now I can do that, I guess. I won’t though; I took it away so that they wouldn’t summon him again."},"index":{"title":"index","links":["Main/Main"],"tags":[],"content":"This is the start page of my site. For all info, please refer to Main\nThis is a project I’m working on. Not heavily, so don’t expect many updates, but I’d like to continue working in the background for a while.\nThis project would be a cool one to come to fruition later down the line, but for now, it’s some various thoughts in an Obsidian vault."}}